src/cf/InformationRegisters/СоответствияОбъектовМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствияОбъектовМаркетплейсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъектаМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МоделиСкладовЯндексМаркета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКабинета</Name>
					<Comment>businessId в Яндекс маркет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВладельцаОбъектаМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СоответствияОбъектовМаркетплейсов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
// Определяет объект соответствия.
//
// Параметры:
//   УчетнаяЗапись        - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
//   ВидОбъекта           - ПеречислениеСсылка.ВидыОбъектовМаркетплейсов - вид объекта маркетплейса.
//   ИдентификаторОбъекта - Строка - идентификатор объекта маркетплейса.
//   ТипОбъекта           - Тип, Неопределено - ограничения по типу объекта.
//
// Возвращаемое значение:
//   Произвольный - объект соответствия.
//
Функция ПолучитьОбъектСоответствия(УчетнаяЗапись, ВидОбъекта, ИдентификаторОбъекта, ТипОбъекта = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СоответствияОбъектовМаркетплейсов.Объект1С КАК Объект1С
		|ИЗ
		|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
		|ГДЕ
		|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
		|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = &ВидОбъекта
		|	И СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись",        УчетнаяЗапись);
	Запрос.УстановитьПараметр("ВидОбъекта",           ВидОбъекта);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		Если ТипОбъекта = Неопределено Тогда
			Возврат ВыборкаДанных.Объект1С;
		ИначеЕсли ТипЗнч(ВыборкаДанных.Объект1С) = ТипОбъекта Тогда
			Возврат ВыборкаДанных.Объект1С;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Записывает объект соответствия.
//
// Параметры:
//   УчетнаяЗапись           - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
//   ВидОбъекта              - ПеречислениеСсылка.ВидыОбъектовМаркетплейсов - вид объекта маркетплейса.
//   ИдентификаторОбъекта    - Строка - идентификатор объекта маркетплейса.
//   Объект1С                - Произвольный - объект соответствия.
//   ДополнительныеПараметры - Неопределено -
//                           - Структура Из КлючИЗначение - значения прочих измерений и реквизитов регистра сведений 
//                               СоответствияОбъектовМаркетплейсов.
//
Процедура ЗаписатьОбъектСоответствия(УчетнаяЗапись, ВидОбъекта, ИдентификаторОбъекта, Объект1С, 
			ДополнительныеПараметры = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоответствияОбъектовМаркетплейсов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("УчетнаяЗаписьМаркетплейса",        УчетнаяЗапись);
		ЭлементБлокировки.УстановитьЗначение("ВидОбъектаМаркетплейса",           ВидОбъекта);
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторОбъектаМаркетплейса", ИдентификаторОбъекта);
		Если ДополнительныеПараметры <> Неопределено
				И ДополнительныеПараметры.Свойство("ИдентификаторВладельцаОбъектаМаркетплейса") Тогда
			ЭлементБлокировки.УстановитьЗначение("ИдентификаторВладельцаОбъектаМаркетплейса", 
				ДополнительныеПараметры.ИдентификаторВладельцаОбъектаМаркетплейса);
		КонецЕсли;
		ЭлементБлокировки.УстановитьЗначение("Объект1С", Объект1С);
		Блокировка.Заблокировать();        
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗаписьМаркетплейса.Установить(УчетнаяЗапись);
		НаборЗаписей.Отбор.ВидОбъектаМаркетплейса.Установить(ВидОбъекта);
		НаборЗаписей.Отбор.ИдентификаторОбъектаМаркетплейса.Установить(ИдентификаторОбъекта);
		Если ДополнительныеПараметры <> Неопределено
				И ДополнительныеПараметры.Свойство("ИдентификаторВладельцаОбъектаМаркетплейса") Тогда
			НаборЗаписей.Отбор.ИдентификаторВладельцаОбъектаМаркетплейса.Установить(
				ДополнительныеПараметры.ИдентификаторВладельцаОбъектаМаркетплейса);  
		КонецЕсли;
		НаборЗаписей.Отбор.Объект1С.Установить(Объект1С);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Запись, ДополнительныеПараметры);
		КонецЕсли;
		
		Запись.УчетнаяЗаписьМаркетплейса        = УчетнаяЗапись;
		Запись.ВидОбъектаМаркетплейса           = ВидОбъекта;
		Запись.ИдентификаторОбъектаМаркетплейса = ИдентификаторОбъекта;
		Запись.Объект1С                         = Объект1С;
		Если ДополнительныеПараметры = Неопределено Тогда
			Запись.ДатаАктуальности = ТекущаяДатаСеанса();
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При записи данных соответствия для объекта %1 возникла ошибка: %2'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Объект1С,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписьЖурналаРегистрации(ИнтеграцияСМаркетплейсамиСервер.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
